Number-008/Undergraduate-Electronics-Design-Contest/MSP430/msp430g2553（部分寄存器中文注释）.h
//GPIO
SFR_8BIT(P1IN);                               /* Port 1 Input */
SFR_8BIT(P1OUT);                              /* Port 1 Output */
SFR_8BIT(P1DIR);                              /* Port 1 Direction */				//PxDIR(IO口输入输出方向选择)：1--输出，0--输入；
SFR_8BIT(P1IFG);                              /* Port 1 Interrupt Flag */			//PxIFG（中断标志位）: 1--中断条件曾经成立过，0--中断条件不成立（清除标志位）
SFR_8BIT(P1IES);                              /* Port 1 Interrupt Edge Select */	//PxIES(电平触发边沿) :1--下降沿触发，0--上升沿触发
SFR_8BIT(P1IE);                               /* Port 1 Interrupt Enable */			//PxIE(中断使能):      1--允许中断，  0--不允许中断；
SFR_8BIT(P1SEL);                              /* Port 1 Selection */				//PxSEL(第二功能选择)： 1--第二功能，  0--普通功能
SFR_8BIT(P1SEL2);                             /* Port 1 Selection 2 */
SFR_8BIT(P1REN);                              /* Port 1 Resistor Enable */			//PxREN（IO口上下拉）:1--打开IO口上下拉，0--关闭IO口上下拉;

SFR_8BIT(P2IN);                               /* Port 2 Input */
SFR_8BIT(P2OUT);                              /* Port 2 Output */
SFR_8BIT(P2DIR);                              /* Port 2 Direction */
SFR_8BIT(P2IFG);                              /* Port 2 Interrupt Flag */
SFR_8BIT(P2IES);                              /* Port 2 Interrupt Edge Select */
SFR_8BIT(P2IE);                               /* Port 2 Interrupt Enable */
SFR_8BIT(P2SEL);                              /* Port 2 Selection */
SFR_8BIT(P2SEL2);                             /* Port 2 Selection 2 */
SFR_8BIT(P2REN);                              /* Port 2 Resistor Enable */

//PxSEL2		PxSEL       Pin Function
// 0			 0			I/O function is selected.
// 0			 1			Primary peripheral module function is selected.
// 1			 0			Reserved. See device-specific data sheet.
// 1			 1			Secondary peripheral module function is selected.


/************************************************************
* DIGITAL I/O Port3 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT3_R__                /* Definition to show that Module is available */

SFR_8BIT(P3IN);                               /* Port 3 Input */
SFR_8BIT(P3OUT);                              /* Port 3 Output */
SFR_8BIT(P3DIR);                              /* Port 3 Direction */
SFR_8BIT(P3SEL);                              /* Port 3 Selection */
SFR_8BIT(P3SEL2);                             /* Port 3 Selection 2 */
SFR_8BIT(P3REN);                              /* Port 3 Resistor Enable */

/************************************************************
* Timer0_A3
************************************************************/
#define __MSP430_HAS_TA3__                    /* Definition to show that Module is available */

SFR_16BIT(TA0IV);                             /* Timer0_A3 Interrupt Vector Word */
SFR_16BIT(TA0CTL);                            /* Timer0_A3 Control */
SFR_16BIT(TA0CCTL0);                          /* Timer0_A3 Capture/Compare Control 0 */
SFR_16BIT(TA0CCTL1);                          /* Timer0_A3 Capture/Compare Control 1 */
SFR_16BIT(TA0CCTL2);                          /* Timer0_A3 Capture/Compare Control 2 */
SFR_16BIT(TA0R);                              /* Timer0_A3 */
SFR_16BIT(TA0CCR0);                           /* Timer0_A3 Capture/Compare 0 */
SFR_16BIT(TA0CCR1);                           /* Timer0_A3 Capture/Compare 1 */
SFR_16BIT(TA0CCR2);                           /* Timer0_A3 Capture/Compare 2 */

/* Alternate register names */
#define TAIV                   TA0IV          /* Timer A Interrupt Vector Word */
#define TACTL                  TA0CTL         /* Timer A Control */                   	//Timer A 控制寄存器
#define TACCTL0                TA0CCTL0       /* Timer A Capture/Compare Control 0 */	//Timer A 捕获/比较控制寄存器0
#define TACCTL1                TA0CCTL1       /* Timer A Capture/Compare Control 1 */	//Timer A 捕获/比较控制寄存器1
#define TACCTL2                TA0CCTL2       /* Timer A Capture/Compare Control 2 */	//Timer A 捕获/比较控制寄存器2
#define TAR                    TA0R           /* Timer A */								//16位计数器
#define TACCR0                 TA0CCR0        /* Timer A Capture/Compare 0 */
#define TACCR1                 TA0CCR1        /* Timer A Capture/Compare 1 */
#define TACCR2                 TA0CCR2        /* Timer A Capture/Compare 2 */
#define TAIV_                  TA0IV_         /* Timer A Interrupt Vector Word */
#define TACTL_                 TA0CTL_        /* Timer A Control */
#define TACCTL0_               TA0CCTL0_      /* Timer A Capture/Compare Control 0 */
#define TACCTL1_               TA0CCTL1_      /* Timer A Capture/Compare Control 1 */
#define TACCTL2_               TA0CCTL2_      /* Timer A Capture/Compare Control 2 */
#define TAR_                   TA0R_          /* Timer A */
#define TACCR0_                TA0CCR0_       /* Timer A Capture/Compare 0 */
#define TACCR1_                TA0CCR1_       /* Timer A Capture/Compare 1 */
#define TACCR2_                TA0CCR2_       /* Timer A Capture/Compare 2 */

/* Alternate register names 2 */
#define CCTL0                  TACCTL0        /* Timer A Capture/Compare Control 0 */	//Timer A 捕获/比较控制寄存器0
#define CCTL1                  TACCTL1        /* Timer A Capture/Compare Control 1 */	//Timer A 捕获/比较控制寄存器1
#define CCTL2                  TACCTL2        /* Timer A Capture/Compare Control 2 */	//Timer A 捕获/比较控制寄存器2
#define CCR0                   TACCR0         /* Timer A Capture/Compare 0 */			//Timer A 捕获/比较寄存器0
#define CCR1                   TACCR1         /* Timer A Capture/Compare 1 */			//Timer A 捕获/比较寄存器1
#define CCR2                   TACCR2         /* Timer A Capture/Compare 2 */			//Timer A 捕获/比较寄存器2
#define CCTL0_                 TACCTL0_       /* Timer A Capture/Compare Control 0 */
#define CCTL1_                 TACCTL1_       /* Timer A Capture/Compare Control 1 */
#define CCTL2_                 TACCTL2_       /* Timer A Capture/Compare Control 2 */
#define CCR0_                  TACCR0_        /* Timer A Capture/Compare 0 */
#define CCR1_                  TACCR1_        /* Timer A Capture/Compare 1 */
#define CCR2_                  TACCR2_        /* Timer A Capture/Compare 2 */

//TACTL控制寄存器设置
//	15~10	9		8		7	 	6		5		4		3		2		1		0
//	未用      SSEL1		SSEL2	ID1	 	ID0		MC1		MC0		未用		CLR		TAIE	TAIFG
#define TASSEL1                (0x0200)       /* Timer A clock source select 1 */
#define TASSEL0                (0x0100)       /* Timer A clock source select 0 */
#define ID1                    (0x0080)       /* Timer A clock input divider 1 */
#define ID0                    (0x0040)       /* Timer A clock input divider 0 */
#define MC1                    (0x0020)       /* Timer A mode control 1 */
#define MC0                    (0x0010)       /* Timer A mode control 0 */

#define TACLR                  (0x0004)       /* Timer A counter clear */					   //定时器清除位
#define TAIE                   (0x0002)       /* Timer A counter interrupt enable */           //定时器中断允许位（允许）
#define TAIFG                  (0x0001)       /* Timer A counter interrupt flag */             //定时器溢出标志位，CCR0计数到0时TAIFG置位

//计数模式（MC1	MC0	）
#define MC_0                   (0*0x10u)      /* Timer A mode control: 0 - Stop */				//停止模式
#define MC_1                   (1*0x10u)      /* Timer A mode control: 1 - Up to CCR0 */		//从0增计数到CCR0
#define MC_2                   (2*0x10u)      /* Timer A mode control: 2 - Continous up */		//从0到65535连续计数
#define MC_3                   (3*0x10u)      /* Timer A mode control: 3 - Up/Down */			//从0增计数到CCR0再从CCRO减计数到0
//输入时钟分频（ID1	 	ID0	）
#define ID_0                   (0*0x40u)      /* Timer A input divider: 0 - /1 */               //输入不分频
#define ID_1                   (1*0x40u)      /* Timer A input divider: 1 - /2 */				//输入2分频
#define ID_2                   (2*0x40u)      /* Timer A input divider: 2 - /4 */				//输入4分频
#define ID_3                   (3*0x40u)      /* Timer A input divider: 3 - /8 */				//输入8分频
//Timer_A时钟源（SSEL1		SSEL2）
#define TASSEL_0               (0*0x100u)     /* Timer A clock source select: 0 - TACLK */		//用特定的外部引脚信号
#define TASSEL_1               (1*0x100u)     /* Timer A clock source select: 1 - ACLK  */      //辅助时钟，一般为32KHZ
#define TASSEL_2               (2*0x100u)     /* Timer A clock source select: 2 - SMCLK */		//次系统时钟
#define TASSEL_3               (3*0x100u)     /* Timer A clock source select: 3 - INCLK */

